src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/торо_УстановкаАналоговНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="70713d91-cbcb-4e92-ac9f-a0a817d6e0ce">
  <name>торо_УстановкаАналоговНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3941362c-26be-4fff-a565-63e2a4c4214a">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34ec1fe8-0682-46e1-9881-f904b5468771">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="424f5519-312d-42a6-ac10-615c02711cf2">
    <name>УказаниеПоПрименению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26bac8ba-27be-488f-ba8f-9b81a02af2d2">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59bb11af-2006-4299-a16c-2a763773be5f">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6983a326-a9e9-4d7b-b740-6b3f76280b8c">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2c92ace-8e7a-43f2-a392-285cbac3ad37">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f1ae0b5-4b90-4756-96fa-c5647a70a735">
    <name>СписокОбъектовРМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e8926b2-9f0c-491e-9210-4dda111cb257">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="afd8c838-4157-4908-a6bc-13e15246f203">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b968bd78-d9f7-4136-b7f5-27eb5b522e66">
    <name>проф_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="909b34e1-9074-4194-945d-47599019dd04">
    <name>Аналоги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="516454eb-a002-4aa7-8e2d-4ae0f2cb11f7">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2d2125b4-e902-4499-8955-1cfbf0b37e03">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e5560730-2fd7-492d-80f3-ed2e8044197f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b1c2cab1-49ce-4f27-9ed4-59c15c3d370e">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="884799a4-d659-4fea-917e-798420697301">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2201f132-10ef-4ff7-9f15-83c61b78d683">
    <name>Материалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6ac84c55-480e-4ee8-b529-9b2a86b5b25b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84ac5858-07f7-4abb-a4c5-b59bbdff0e63">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b48b0cdc-05dd-409f-b3a0-8085af8ffa5f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57210a28-5600-40dd-ad64-ebc75b73765a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e502bc90-b43e-4dc6-ac08-9de107ff5d82">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a180ce65-2990-4b3d-80fc-83f6ef430224">
      <name>КлючСвязиТехКарта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #4, Башинская А.Ю., 14.08.2023
	НовыйЭлемент = Элементы.Добавить("проф_Статус", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.проф_Статус";    
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
		
	НовыйЭлемент = Элементы.Добавить("проф_Комментарий", Тип("ПолеФормы"), ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.проф_Комментарий";    
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;  
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	//-- Проф-ИТ, #4, Башинская А.Ю., 14.08.2023
	
	//++ Проф-ИТ, #246, Башинская А.Ю., 10.09.2023
	НовыйЭлемент = Элементы.Добавить("проф_НадписьНомераСтрок", Тип("ДекорацияФормы"), Элементы.ГруппаОбластьДействия);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Внимание! Номер строки оригинала соответствует номеру строки аналога!"; 
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.ЦветТекста = WebЦвета.Красный; 
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	//-- Проф-ИТ, #246, Башинская А.Ю., 10.09.2023      
		
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПредставлениеОбластиДействияНажатие")
Процедура проф_ПредставлениеОбластиДействияНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;

	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ВидРемонта", Объект.ВидРемонта);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("ТехКарта", Объект.ТехКарта);
	ПараметрыФормы.Вставить("ОбъектРемонта", Объект.ОбъектРемонта);
	#Удаление
	ПараметрыФормы.Вставить("НаправлениеОбъектаРемонта", Объект.НаправлениеОбъектаРемонта);      
	#КонецУдаления  
	#Вставка
	//++ Проф-ИТ, #4, Башинская А.Ю., 28.08.2023
	ПараметрыФормы.Вставить("НаправлениеОбъектаРемонта", Объект.проф_НаправлениеДеятельности);
	#КонецВставки
	ПараметрыФормы.Вставить("СписокОбъектовРМ", Объект.СписокОбъектовРМ);
	ПараметрыФормы.Вставить("КоличествоМатериалов", Объект.Материалы.Количество());
	
	ОткрытьФорму("Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Форма.ФормаВводаОбластиДействия", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьПредставлениеОбластиДействия")
Процедура проф_ОбновитьПредставлениеОбластиДействия()

	ПредставлениеОбластиДействия = "";

	Если ЗначениеЗаполнено(Объект.Организация) Тогда

		Шаблон = НСтр("ru = 'Организация: %1;'") + " ";

		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.Организация);

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ВидРемонта) Тогда

		Шаблон = НСтр("ru = 'Вид ремонта: %1;'") + " ";

		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.ВидРемонта);

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда

		Шаблон = НСтр("ru = 'Подразделение: %1;'") + " ";

		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.Подразделение);

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ТехКарта) Тогда

		Шаблон = НСтр("ru = 'Технологическая карта: %1;'") + " ";

		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.ТехКарта);

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОбъектРемонта) Тогда

		Шаблон = НСтр("ru = 'Объект ремонта: %1;'") + " ";

		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.ОбъектРемонта);

	КонецЕсли;
	
	#Удаление
	Если ЗначениеЗаполнено(Объект.НаправлениеОбъектаРемонта) Тогда
		
		Шаблон = НСтр("ru = 'Направление объекта ремонта: %1;'") + " ";
		
		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.НаправлениеОбъектаРемонта);
		
	КонецЕсли;
	#КонецУдаления
	#Вставка
	//++ Проф-ИТ, #4, Башинская А.Ю., 28.08.2023
	Если ЗначениеЗаполнено(Объект.проф_НаправлениеДеятельности) Тогда
		
		Шаблон = НСтр("ru = 'Направление объекта ремонта: %1;'") + " ";
		
		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.проф_НаправлениеДеятельности);
		
	КонецЕсли;     
	//-- Проф-ИТ, #4, Башинская А.Ю., 28.08.2023
	#КонецВставки
	
	Если ЗначениеЗаполнено(Объект.СписокОбъектовРМ) Тогда 
		Шаблон = НСтр("ru = 'Список объектов регламентного мероприятия: %1;'") + " ";
		
		ПредставлениеОбластиДействия = ПредставлениеОбластиДействия + СтрШаблон(Шаблон, Объект.СписокОбъектовРМ);
		
	КонецЕсли;

	Если СтрДлина(ПредставлениеОбластиДействия) > 0 Тогда
		ПредставлениеОбластиДействия = Лев(ПредставлениеОбластиДействия, СтрДлина(ПредставлениеОбластиДействия) - 2);
	Иначе
		ПредставлениеОбластиДействия = НСтр("ru = 'По предприятию в целом'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура проф_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	ВыполняемаяОперация = "";
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ВыполняемаяОперация", ВыполняемаяОперация) и ВыполняемаяОперация = "ВыборОбластиДействия" Тогда

		Модифицированность = Истина;

		ЗначениеВыбора = ВыбранноеЗначение.ЗначениеВыбора;

		СписокСвойств = "Организация, ВидРемонта, Подразделение, ТехКарта, ОбъектРемонта, НаправлениеОбъектаРемонта, СписокОбъектовРМ";
		
		ЗаполнитьЗначенияСвойств(Объект, ЗначениеВыбора, СписокСвойств);
		#Вставка
		//++ Проф-ИТ, #4, Башинская А.Ю., 28.08.2023
		Объект.проф_НаправлениеДеятельности = ЗначениеВыбора.НаправлениеОбъектаРемонта;
		#КонецВставки
		ОбновитьПредставлениеОбластиДействия();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура проф_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	//++ Проф-ИТ, #246, Башинская А.Ю., 10.09.2023
	Если Объект.Материалы.Количество() <> Объект.Аналоги.Количество() Тогда
		ТекстСообщения = "Количество строк оригиналов не соответствует количеству строк аналогов!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Материалы[0].НомерСтроки",, Отказ);
		Возврат;	
	КонецЕсли;   
	
	ОтборСтроки = Новый Структура("НомерСтроки");
	Для Каждого СтрМ Из Объект.Материалы Цикл                
		ОтборСтроки.НомерСтроки = СтрМ.НомерСтроки;
		СтрА = Объект.Аналоги.НайтиСтроки(ОтборСтроки);
		Если СтрА.Количество() И СтрА[0].Номенклатура = СтрМ.Номенклатура Тогда    
			ТекстСообщения = "По строке " + СтрМ.НомерСтроки + " одинаковая номенклатура! Номенклатура оригинала не должна быть равна номенклатуре аналога.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Материалы[" + СтрМ.НомерСтроки + "].Номенклатура",, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//-- Проф-ИТ, #246, Башинская А.Ю., 10.09.2023
	
КонецПроцедуры

#КонецОбласти
